Revit 2027 API
ParameterTypeId.SteelElemWeldMainText Property
 "Main Text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldMainText { get; }
Public Shared ReadOnly Property SteelElemWeldMainText As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldMainText {
	ForgeTypeId^ get ();
}
static member SteelElemWeldMainText : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace